{
    
        "recipes": [
            {
                "id": 1,
                "food-name": "Chapati",
                "ingredients": "All-purpose flour <depending on how one is making>, 1 teaspoon of salt <depends on you>, 1 teaspoon sugar <depends on you> (optional), water, cooking oil",
                "procedure": "Step 1: Mix the dry ingredients, namely all-purpose flour, salt, and sugar in a large bowl. Add some oil, and the water a little at a time, then use your fists to knead everything to a dough.\n Step 2: Add the oil and knead some more, for about two minutes. The dough should now feel soft and flexible, and also should no longer stick to the fingers.\n Step 3: Cover the dough with a clean kitchen cloth or plastic basin and allow it to rest for at least 30 minutes at room temperature.\n Step 4: Divide the dough into equally-sized balls. Lightly dust a wooden board or your kitchen counter with flour, roll each ball of dough in flour and use a rolling pin to roll each into a circular shape.\n Step 5: Brush each chapati with a bit of cooking oil, lightly sprinkle some flour on top, then roll it so it resembles a rope. Coil the rope of dough towards the center, and tuck the end in the middle, this will make it look almost as a cinnamon roll.\n Step 6: Cover the coiled balls of dough with a clean kitchen cloth and allow this to rest for 10 minutes. Next, lightly dust your kitchen counter or wooden board with flour again and roll out each ball to a circular-shape.\n Step 7: Bring a non-sticky pan to high heat. Once hot, reduce the heat to a medium and place the rolled chapati dough on top. Cook each side until brown spots form.\n Step 8: Lightly brush the cooked surface with cooking oil, allowing the bottom to also become brown and puff up, flip and fry the oiled side for one to two minutes or until cooked equally.",
                "servings": "Serve chapati with beef stew, chicken stew, ndengu (peas), cabbage, spinach or your favourite stew dishes",
                "description": "Chapati is an unleavened flat-circular bread normally made using all-purpose wheat flour, water, salt, and oil. It is especially popular in Kenya and is mostly eaten during the holidays.",
                "food-image": "https://www.google.com/url?sa=i&url=http%3A%2F%2Fwww.watamukenya.net%2Fen%2Farticles%2Fnews%2Flast-news%2Fthe-swahili-chapati.html&psig=AOvVaw3AjVYCdkx5BzG5tdZkQk4j&ust=1690899558450000&source=images&cd=vfe&opi=89978449&ved=0CA4QjRxqFwoTCOiK7_KRuYADFQAAAAAdAAAAABAD"
            },
            {
                "id": 2,
            "food-name": "Mandazi",
            "ingredients": "Self-raising flour, 2 teaspoon of sugar, cardamom, 1 packet of milk, 2 eggs, lemon zest, cooking oil",
            "procedure": "Step 1: Making the dough: in a bowl, sift the self-raising flour, sugar and cardamom. Add the grated lemon zest then make a well in the center to add the warm milk together with eggs and a bit of oil. Use your hands to knead until all the ingredients come together, and the dough is smooth, taking care not to overwork the dough. Cover the bowl with cling film, or a slightly damp kitchen cloth and place it in a warm place in your kitchen, to rest for at least 20 minutes.\n Step 2: Roll out the dough: Once the dough has rested, transfer it to a floured rolling board or a clean kitchen countertop. Divide the dough into 4 portions, and roll each portion between the palms of your hands to form a ball. Roll out each portion of dough to a circular-shape. Cut them into triangle-shapes.\n Step 3: Fry: heat the oil in a large pot to 350°F (180°C) and fry each mandazi for 3-5 minutes on each side, or until golden brown. Transfer them to a kitchen or paper towel-lined bowl to drain.",
            "servings": "Serve the hot-piping mandazis with tea, coffee or even juice",
            "description": "Mandazi refers to buns made by deep-frying dough. It is especially popular in Kenya and is normally served for breakfast with sweetened tea.",
            "food-image": "https://www.google.com/imgres?imgurl=https%3A%2F%2Fanmg-production.anmg.xyz%2Fyazakenya_1xVG8Y6VtXQmPauE1qL8PqGM&tbnid=26fHvRybNc80TM&vet=12ahUKEwiCkuqlm7mAAxVRricCHXdcC1wQMygIegUIARCbAg..i&imgrefurl=https%3A%2F%2Fyazakenya.com%2Ffood%2Ffood%2Fhow-to-cook-the-softest-sweet-mandazi&docid=-icCvAEBAFv4wM&w=600&h=600&q=mandazi&ved=2ahUKEwiCkuqlm7mAAxVRricCHXdcC1wQMygIegUIARCbAg"
            },
            {
                "id": 3,
                "food-name": "Swahili Pilau",
                "ingredients": " 2 glasses of Long-grain basmati rice, ground pilau masala spice, 1/2kg of beef/chicken/lamb, 1 tablespoon of crushed garlic and ginger, 2 onion, 1 packet of tomato paste, 2 teaspoon of salt <depends on you>, cooking oil, whole spices(cumin seeds, green cardamom pods, black peppercorns, cloves, and two cinnamon sticks)",
                "procedure": "Step 1: If not using store-bought seasoning, prepare the ground pilau masala spice by roasting the whole spices (cumin seeds, green cardamom pods, cinnamon sticks, black peppercorns, and cloves). Use a blender or coffee grinder to process it into powder.\n Step 2: Next, clean the rice by rinsing it in a bowl until the water is no longer cloudy. Once clean, soak the rice using cold water.\n Step 3: Soak the whole spices in a cup or a small ramekin.\n Step 4: Boil the meat using water, salt, and the stock cube until tender. This could be goat, beef, lamb or poultry meat, it all depends on what you like. Sieve any excess broth and set it aside, for use when cooking the pilau rice.\n Step 5: Fry the meat and onions until brown, then add the garlic, ginger, and tomato paste. Add the soaked whole spices plus any liquid leftover from soaking the spices, the pilau masala powder, and the potatoes.\n Step 6: Next, add hot water (plus any reserved broth), followed by the rice.\n Step 7: Finally, cook until the rice is tender and all the liquid has evaporated and then serve.",
                "servings": "Serve the Pilau with nyama-choma and kachumbari or your favourite animal stew together with kachumbari and a cold glass of your preferred soda.",
                "description": "It a common food made by the coastal tribes in Kenya. Pilau is made by cooking rice with beef, chicken, or vegetables, in broth and spices. Pilau was such an exceptional dish and was only served during special occasions such as weddings. While it is more commonly consumed nowadays, it remains one of the meals that have to be present whenever there is a celebration of some sort.",
                "food-image": "https://www.google.com/url?sa=i&url=https%3A%2F%2Fcookpad.com%2Fke%2Frecipes%2F10628962-beef-pilau&psig=AOvVaw3yK3WWAfSxqO9t2X5EgjZb&ust=1690903052312000&source=images&cd=vfe&opi=89978449&ved=0CA4QjRxqFwoTCODX9_OeuYADFQAAAAAdAAAAABAD"
            },
            {
                "id": 4,
                "food-name": "Omena",
                "ingredients": "2 cups dried omena fish, 2 small jugs hot water, cooking oil, 2 onions, 2 small cloves garlic, 3 tomatoes, 1 packet of tomato paste, 1 pili pili hoho, 2 chili peppers or dried chili flakes, 1 teaspoon curry powder, 2 teaspoons of salt (or more to taste), 2 cups of water, 1 small bunch of coriander, 2 small lemons",
                "procedure": "Step 1: Place your omena on a kitchen tray and run your fingers through it to check for stones and any other unwanted debris such as shells.\n Step 2: Use hot water to rinse your omena until clean. Next, using two cups of water, boil or soak your fish covered for 10 minutes. Add more water if needed.\n Step 3: Using a sieve, drain the water and set the fish aside. In a pot or pan, heat oil under high heat. Add the sieved omena and fry for about 5 minutes, or until most of the liquid has dried up, stirring from time to time. Once done, set it aside in a bowl and prepare the stew.\n Step 4: Using the same pot or pan, heat oil under medium heat, then fry the onions until golden brown. Add the garlic and cook until fragrant. Next, add the coriander stems, curry powder, salt, chili pepper or dried flakes, then stir to combine.\n Step 5: Add the tomatoes and tomato paste, stir, cover, and allow the tomatoes to cook for about 10 minutes or until most of the water has evaporated and the tomatoes have softened.\n Step 6: Stir in the fried omena and bell pepper. Add a third cup of water or more as preferred if you like your omena to have the consistency of a stew. You can also use milk or coconut milk instead of water. Cover and allow it to simmer for a further 5 minutes.\n Step 7: Once cooked, drizzle some lemon juice on top and garnish with some chopped coriander.",
                "servings": "Serve omena with ugali or rice and your preferred drink choice",
                "description": "Omena is a small fresh-water fish that resembles sardines. The name omena is derived from the Luo language. It is normally prepared into a stew, shallow-fried, or deep-fried.",
                "food-image": "https://www.google.com/imgres?imgurl=http%3A%2F%2Fblog.dmrckenya.co.ke%2Fwp-content%2Fuploads%2F2020%2F05%2Fomena.jpg&tbnid=6oD9YjUCnJK_cM&vet=12ahUKEwi7rfP7prmAAxUImicCHfkABjAQMygJegUIARCIAg..i&imgrefurl=https%3A%2F%2Fblog.dmrckenya.co.ke%2Fbenefits-of-eating-omena%2F&docid=DMGlDQg51Yl1fM&w=1200&h=900&q=omena&ved=2ahUKEwi7rfP7prmAAxUImicCHfkABjAQMygJegUIARCIAg"
            },
            {
                "id": 5,
                "food-name": "Mokimo wa Minji <Mashed potatoes with peas>",
                "ingredients": "3 raw maize, 4 medium cups minji (peas), 1 tin of potatoes, 2 large onions, 3 pilipili (chilli), 2 teaspoons of salt, cooking oil",
                "procedure": "Step 1: Strip the maize from the cobs.\n Step 2: Boil the maize for approximately 1 hour using a meko.\n Step 3: Add the washed peas into the boiling maize and let them boil for another 2 hours.\n Step 4: Peel the potatoes and add them to the boiling maize and peas, and boil for another 45 minutes.\n Step 5: Pour the excess water and then mash the potatoes together with the maize and peas using a cooking stick or an empty, clean 500ml bottle of soda.\n Step 6: After completely mashing the potatoes, add the 2 onions in a new pot and add cooking oil together with the chilli and fry them until the onions are golden brown.\n Step 7: Then add the mokimo and fry for 30 minutes.",
                "servings": "Serve mokimo with nyama/pork/mbuzi choma and kachumbari, beef/mutton, chicken stew, or with just tea.",
                "description": "Mokimo is a cultural food of the Gikuyu people since they love potatoes, so this is the most liked food in the community. It can be eaten any time, be it breakfast, lunch, supper, or as a snack.",
                "food-image": "https://www.google.com/url?sa=i&url=https%3A%2F%2Fcookpad.com%2Fza%2Frecipes%2F3539223-green-mokimo&psig=AOvVaw2wunqriagDXUSGHuv7kbmp&ust=1690911739027000&source=images&cd=vfe&opi=89978449&ved=0CA4QjRxqFwoTCNC11qS_uYADFQAAAAAdAAAAABAD"
            },
            {
                "id": 6,
                "food-name": "Matoke",
                "ingredients": "4 Raw green bananas, 2 onions, 2 tomatoes, coriander, 1 teaspoon of garlic powder, cooking oil, 1 teaspoon of salt, royco cubes",
                "procedure": "Step 1: Peel the bananas; then cut them into two-inch pieces and place them inside salted water to avoid discoloration when they come into contact with air.\nStep 2: Place a saucepan over medium heat and add cooking oil to it. Once the oil is hot, add chopped onion and cook for about 2 minutes or until they are translucent and soft. Next, add garlic and tomatoes and continue to cook for 2 more minutes.\nStep 3: Now, add royco cube and mix well. Cook for a minute or two until spices are fragrant.\nStep 4: Add the green bananas and mix well.\nStep 5: Pour water and stir. Bring the mixture to a boil and cover the saucepan with a lid. Add the coriander and reduce the heat and let the mixture simmer for about 25 minutes or until the green bananas are tender.",
                "servings": "Serve matoke with beef/chicken/mutton stew and your preferred drink of choice.",
                "description": "Matoke basically refers to cooked green bananas particularly popular in the Kisii Region. Cooked to a stew, enjoy matoke as it is as a main dish, or serve it alongside other dishes.",
                "food-image": "https://www.google.com/imgres?imgurl=https%3A%2F%2Fnetstorage-tuko.akamaized.net%2Fimages%2F0fgjhs4d3quku3bpr.jpg&tbnid=Xms6TKd7pzJlbM&vet=12ahUKEwiFyL7hw7mAAxWxsEwKHfAbDzsQMygNegUIARChAg..i&imgrefurl=https%3A%2F%2Fwww.tuko.co.ke%2F259910-best-beef-matoke-recipe-kenya.html&docid=0ElQPGiEBZjsaM&w=1080&h=720&q=matoke%20recipe&ved=2ahUKEwiFyL7hw7mAAxWxsEwKHfAbDzsQMygNegUIARChAg"
            },
            {
                "id": 7,
                "food-name": "Ugali",
                "ingredients": "Maize flour, water",
                "procedure": "Step 1: Boil water in a pot.\nStep 2: Add cornmeal, a little at a time and stir.\nStep 3: Continue stirring; the mixture will form a dough-like consistency as it cooks. Break any lumps that form by pressing them on the sides of your pot.\nStep 4: Shape the ugali, remove it from the heat, transfer it to a plate, and serve.",
                "servings": "Serve ugali with nyama/kuku/pork choma or beef/mutton stew together with kachumbari or even with sukuma wiki or cabbage and your preferred drink of choice.",
                "description": "Ugali is a dish made by cooking maize flour into a type of mush. In Kenya, ugali is considered one of the staple foods and is eaten almost daily.",
                "food-image": "https://www.google.com/imgres?imgurl=https%3A%2F%2Fcdn-images-1.medium.com%2Fmax%2F640%2F1*yC9JWW0o5r6Nt1iveuSQ8g.jpeg&tbnid=5o3E7-BmHYzeiM&vet=12ahUKEwj6463TxbmAAxXapycCHU4dDuUQMygEegUIARCGAg..i&imgrefurl=https%3A%2F%2Frecipesaroundtheworld.com%2Frecipes-around-the-world-ugali-83b9c6768420&docid=qDdE7xGN2OokvM&w=500&h=375&q=ugali&ved=2ahUKEwj6463TxbmAAxXapycCHU4dDuUQMygEegUIARCGAg"
            },
            {
                "id": 8,
                "food-name": "Sukuma Wiki",
                "ingredients": "Sukuma wiki leaves, 1 large onion, 2 large tomatoes, 2 teaspoons of salt, cooking oil",
                "procedure": "Step 1: Prepare the vegetables: wash the sukuma wiki leaves and tomatoes. Peel and slice the onion, tomatoes, and sukuma wiki.\nStep 2: Fry the onion and tomatoes: heat oil in a pan. Fry the onion until golden brown, then stir in the tomatoes and allow them to cook until softened.\nStep 3: Once the tomatoes are cooked through, add the sukuma wiki leaves and some salt. Cover and allow to cook until done.\nStep 4: Season: add more salt.",
                "servings": "Serve sukuma wiki with ugali, nyama/kuku/pork choma and your preferred drink of choice.",
                "description": "Sukuma wiki is a common and popular staple dish in Kenya, that is normally served with ugali.",
                "food-image": "https://www.google.com/imgres?imgurl=https%3A%2F%2Fafricanbites.com%2Fwp-content%2Fuploads%2F2015%2F01%2FIMG_6581.jpg&tbnid=PbNLQw7ePfZE2M&vet=12ahUKEwiNk-fYx7mAAxUKnCcCHXkjDzYQMygoegUIARDcAg..i&imgrefurl=https%3A%2F%2Fwww.africanbites.com%2Fsukuma-wiki%2F&docid=ufpmlntZQzLmBM&w=616&h=800&q=sukuma%20wiki&ved=2ahUKEwiNk-fYx7mAAxUKnCcCHXkjDzYQMygoegUIARDcAg"
            },
            {
                "id": 9,
                "food-name": "Nyama choma",
                "ingredients": "Mbuzi meat (ribs or long-bone leg), 1 fresh ginger, 1/2 garlic, 2 onions, cumin, paprika, lemon juice, honey, cooking oil, chili, and salt.",
                "marination": "Step 1: Prepare the nyama choma marinade by adding all the marinade ingredients to a blender and processing (garlic, ginger, onion, lemon juice, cooking oil, cumin, paprika, chili, salt).\nStep 2: On a chopping board, use a knife to make slits or gashes on the goat leg.\nStep 3: Put the goat meat in a large bowl, toss with some of the marinade on top, making sure to cover the slits. Reserve some of the marinade for basting during grilling.\nStep 4: Cover with aluminum foil and allow it to marinate for at least two hours or for best results overnight, before grilling.",
                "procedure": "Step 1: Using an oven, preheat the oven to 170°C / 365°F (standard) or 150°C fan then lay the meat on a baking tray. Place in the oven and slowly roast for 4.5 hours. Bear in mind that the time may differ, depending on the cut of meat you are using. Therefore, feel free to add or decrease the cooking time.\nStep 2: Once the time is up, mix the honey with 2-3 tablespoons of hot water. Uncover the foil and baste with the honey glaze (optional). Broil each side for 5-10 minutes or until the desired brownness has been achieved. It is done when it has an internal temperature of at least 150-160 degrees F (65.6°C), and the juices run clear.\nStep 3: Once cooked, transfer the nyama choma to a tray and allow it to rest for at least 10-20 minutes before carving and serving.",
                "servings": "Serve the nyama choma with ugali or chips and kachumbari and a cold drink, preferably a cold Tusker.",
                "description": "Nyama choma is very popular in Kenya and is actually one of the meals that is always served whenever there is a barbecue, or whenever friends and family come together during football matches, for Friday evening meals, weddings, simply put, every occasion that calls for celebration.",
                "food-image": "https://www.google.com/url?sa=i&url=https%3A%2F%2Fwww.the-star.co.ke%2Fsasa%2Ffood%2F2023-03-10-how-to-make-mouth-watering-nyama-choma%2F&psig=AOvVaw34-6ob9iS5gpYqbBIKHud_&ust=1690915082662000&source=images&cd=vfe&opi=89978449&ved=0CA4QjRxqFwoTCMjs_NjLuYADFQAAAAAdAAAAABAE"
            },
            {
                "id": 10,
                "food-name": "Ndengu <green grams>",
                "ingredients": "Ndengu beans, minced garlic and ginger, 1 large onion, 2 tomatoes, 2 teaspoons of salt, royco cubes, turmeric, cooking oil, coriander",
                "procedure": "Step 1: Clean, then boil the green grams using water until soft and tender.\nStep 2: Drain away any excess liquid and set the green grams aside. Heat some oil in a pot or pan and fry the onion until translucent and fragrant. Add the garlic, ginger, tomatoes, and coriander stems. Cook until the tomatoes soften.\nStep 3: Stir in the salt, curry powder, and the rest of the spices.\nStep 4: Finally, add the ndengu and simmer until cooked. Garnish with some coriander leaves and serve!",
                "servings": "Serve ndengu with chapati or rice with your preferred drink.",
                "description": "Ndengu is a popular Kenyan stew made by cooking mung beans in a tomato and onion-based sauce. This is then seasoned using different spices such as curry powder.",
                "food-image": "https://www.google.com/imgres?imgurl=https%3A%2F%2Fenvirofit.org%2Fwp-content%2Fuploads%2F2017%2F08%2FStewed-Ndengu-1.jpg&tbnid=RayEN3sxd_vMUM&vet=12ahUKEwjg-Iz8zbmAAxUtrycCHaFIBFAQMygDegUIARD6AQ..i&imgrefurl=https%3A%2F%2Fenvirofit.org%2Fsuperchef-stewed-ndengu%2F&docid=plfgMLxcWPWjzM&w=700&h=700&q=ndengu&ved=2ahUKEwjg-Iz8zbmAAxUtrycCHaFIBFAQMygDegUIARD6AQ"
            }
            
        ]
    
}
   